#1. Գրել ծրագիր, որը կվերադարձնի տրված լիստը առանց կրկնվող էլեմենտների
lst1 = [1,2,2,2,5,7,8,1,11]
lst2 = [0,2,2,3,5,7,8,0,10]

st = set(lst1)
print("#1 ", st)

#2. Գրել ծրագիր, որը տրված 2 ցուցակների համար կվերադարձնի նրանց ընդհանուր էլեմենտների բազմությունը
st2 = set(lst1) & set(lst2)
print("#2 ", st2)

#3. Գրել ծրագիր, որը տրված երկու ցուցակների համար կվերադարձնի այն էլեմենտները, որոնք կան առաջինում, բայց չկան երկրորդում
st3 = set(lst1) - set(lst2)
print("#3 ", st3)

#4. Գրել ծրագիր, որը տրված երկու ցուցակների համար կվերադարձնի այն էլեմենտները, որոնք կան կամ առաջինում, կամ երկրորդում,
# բայց ոչ միաժամանակ երկուսում էլ։
st4 = set(lst1) ^ set(lst2)
print("#4 ", st4)

#5. Գրել ծրագիր, որը տրված երկու ցուցակների համար կվերադարձնի այն էլեմենտները, որոնք կան կամ առաջին ցուցակում,
# կամ երկրորդ, կամ երկուսում միաժամանակ
st5 = set(lst1) | set(lst2)
print("#5 ", st5)

#6. Գրել ծրագիրը, որը կստանա բազմություն և էլեմենտի արժեք, ու բազմությունից կհեռացնի տվյալ արժեքով էլեմենտը։
l = {'b','c','a','d'}
l.remove('a')
print("#6 ", l)

#7. Գրել ծրագիր, որը կստանա թվերի բազմություն և կվերադարձնի ցուցակ,
# որի էլեմենտները կլինեն բազմության էլեմենտների խորանարդները։
numSet = {1,2,3,4,5}
newList = []
for x in numSet:
    newList.append(x**3)
print("#7 ", newList)
